hci_template/app/controllers/categories_controller.rb

  def index
    @category = Category.where(:parent_id => nil)
---
SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" IS NULL