hci_template/app/controllers/home_controller.rb

  def index
    @top_products = Product.limit(6)
---
SELECT "products".* FROM "products" LIMIT 6