hci_template/app/controllers/products_controller.rb

SELECT "products".* FROM "products" LIMIT 45
SELECT "products".* FROM "products" WHERE "products"."category_id" = 1 LIMIT 45
---
  def index
    @top_products = Product.limit(params[:limit] || 45)
    if params[:category]
      @top_products = @top_products.where(:category_id => params[:category])